GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F13143.inc
;-----Bank57------------------
NVMADR           EQU  H'1C8C'
NVMADRL          EQU  H'1C8C'
NVMADRH          EQU  H'1C8D'
NVMDAT           EQU  H'1C8E'
NVMDATL          EQU  H'1C8E'
NVMDATH          EQU  H'1C8F'
NVMCON1          EQU  H'1C90'
NVMCON2          EQU  H'1C91'
SCANCON0         EQU  H'1C92'
SCANLADR         EQU  H'1C93'
SCANLADRL        EQU  H'1C93'
SCANLADRH        EQU  H'1C94'
SCANHADR         EQU  H'1C96'
SCANHADRL        EQU  H'1C96'
SCANHADRH        EQU  H'1C97'
SCANDPS          EQU  H'1C99'
SCANTRIG         EQU  H'1C9A'
CRCDATA          EQU  H'1C9D'
CRCDATAL         EQU  H'1C9D'
CRCDATAH         EQU  H'1C9E'
CRCDATAU         EQU  H'1C9F'
CRCDATAT         EQU  H'1CA0'
CRCOUT           EQU  H'1CA1'
CRCSHFT          EQU  H'1CA1'
CRCXOR           EQU  H'1CA1'
CRCOUTL          EQU  H'1CA1'
CRCSHFTL         EQU  H'1CA1'
CRCSHIFTL        EQU  H'1CA1'
CRCXORL          EQU  H'1CA1'
CRCOUTH          EQU  H'1CA2'
CRCSHFTH         EQU  H'1CA2'
CRCSHIFTH        EQU  H'1CA2'
CRCXORH          EQU  H'1CA2'
CRCOUTU          EQU  H'1CA3'
CRCSHFTU         EQU  H'1CA3'
CRCSHIFTU        EQU  H'1CA3'
CRCXORU          EQU  H'1CA3'
CRCOUTT          EQU  H'1CA4'
CRCSHFTT         EQU  H'1CA4'
CRCSHIFTT        EQU  H'1CA4'
CRCXORT          EQU  H'1CA4'
CRCCON0          EQU  H'1CA5'
CRCCON1          EQU  H'1CA6'
CRCCON2          EQU  H'1CA7'

;-----Bank58------------------
ADLTH            EQU  H'1D0C'
ADLTHL           EQU  H'1D0C'
ADLTHH           EQU  H'1D0D'
ADUTH            EQU  H'1D0E'
ADUTHL           EQU  H'1D0E'
ADUTHH           EQU  H'1D0F'
ADERR            EQU  H'1D10'
ADERRL           EQU  H'1D10'
ADERRH           EQU  H'1D11'
ADSTPT           EQU  H'1D12'
ADSTPTL          EQU  H'1D12'
ADSTPTH          EQU  H'1D13'
ADFLTR           EQU  H'1D14'
ADFLTRL          EQU  H'1D14'
ADFLTRH          EQU  H'1D15'
ADACC            EQU  H'1D16'
ADACCL           EQU  H'1D16'
ADACCH           EQU  H'1D17'
ADACCU           EQU  H'1D18'
ADCNT            EQU  H'1D19'
ADRPT            EQU  H'1D1A'
ADPREV           EQU  H'1D1B'
ADPREVL          EQU  H'1D1B'
ADPREVH          EQU  H'1D1C'
ADRES            EQU  H'1D1D'
ADRESL           EQU  H'1D1D'
ADRESH           EQU  H'1D1E'
ADPCH            EQU  H'1D1F'
ADACQ            EQU  H'1D21'
ADACQL           EQU  H'1D21'
ADACQH           EQU  H'1D22'
ADCAP            EQU  H'1D23'
ADPRE            EQU  H'1D24'
ADPREL           EQU  H'1D24'
ADPREH           EQU  H'1D25'
ADCON0           EQU  H'1D26'
ADCON1           EQU  H'1D27'
ADCON2           EQU  H'1D28'
ADCON3           EQU  H'1D29'
ADSTAT           EQU  H'1D2A'
ADREF            EQU  H'1D2B'
ADACT            EQU  H'1D2C'
ADCLK            EQU  H'1D2D'
ADCG1A           EQU  H'1D2E'
ADCG1B           EQU  H'1D2F'
ADCG1C           EQU  H'1D30'

;-----Bank59------------------
RA0PPS           EQU  H'1D8C'
RA1PPS           EQU  H'1D8D'
RA2PPS           EQU  H'1D8E'
RA4PPS           EQU  H'1D90'
RA5PPS           EQU  H'1D91'
RB4PPS           EQU  H'1D98'
RB5PPS           EQU  H'1D99'
RB6PPS           EQU  H'1D9A'
RB7PPS           EQU  H'1D9B'
RC0PPS           EQU  H'1D9C'
RC1PPS           EQU  H'1D9D'
RC2PPS           EQU  H'1D9E'
RC3PPS           EQU  H'1D9F'
RC4PPS           EQU  H'1DA0'
RC5PPS           EQU  H'1DA1'
RC6PPS           EQU  H'1DA2'
RC7PPS           EQU  H'1DA3'

;-----Bank60------------------
PPSLOCK          EQU  H'1E0C'
INTPPS           EQU  H'1E0D'
T0CKIPPS         EQU  H'1E0E'
T1CKIPPS         EQU  H'1E0F'
T1GPPS           EQU  H'1E10'
T2INPPS          EQU  H'1E19'
CCP1PPS          EQU  H'1E1E'
CCP2PPS          EQU  H'1E1F'
CLCIN0PPS        EQU  H'1E3D'
CLCIN1PPS        EQU  H'1E3E'
CLCIN2PPS        EQU  H'1E3F'
CLCIN3PPS        EQU  H'1E40'
CK1PPS           EQU  H'1E41'
RX1DTPPS         EQU  H'1E41'
RX1PPS           EQU  H'1E42'
TX1CKPPS         EQU  H'1E42'

;-----Bank61------------------
SSP1CLKPPS       EQU  H'1E47'
SSP1DATPPS       EQU  H'1E48'
SSP1SSPPS        EQU  H'1E49'
ADACTPPS         EQU  H'1E50'
CLBIN0PPS        EQU  H'1E57'
CLBIN1PPS        EQU  H'1E58'
CLBIN2PPS        EQU  H'1E59'
CLBIN3PPS        EQU  H'1E5A'
ANSELA           EQU  H'1E8C'
WPUA             EQU  H'1E8D'
ODCONA           EQU  H'1E8E'
SLRCONA          EQU  H'1E8F'
INLVLA           EQU  H'1E90'
IOCAP            EQU  H'1E91'
IOCAN            EQU  H'1E92'
IOCAF            EQU  H'1E93'
ANSELB           EQU  H'1E96'
WPUB             EQU  H'1E97'
ODCONB           EQU  H'1E98'
SLRCONB          EQU  H'1E99'
INLVLB           EQU  H'1E9A'
IOCBP            EQU  H'1E9B'
IOCBN            EQU  H'1E9C'
IOCBF            EQU  H'1E9D'
ANSELC           EQU  H'1EA0'
WPUC             EQU  H'1EA1'
ODCONC           EQU  H'1EA2'
SLRCONC          EQU  H'1EA3'
INLVLC           EQU  H'1EA4'
IOCCP            EQU  H'1EA5'
IOCCN            EQU  H'1EA6'
IOCCF            EQU  H'1EA7'

;-----Bank62------------------
RB4I2C           EQU  H'1EE5'
RB6I2C           EQU  H'1EE7'
UMTOAP           EQU  H'1F0C'
UMTOAL           EQU  H'1F0D'
UMTOAH           EQU  H'1F0E'

;-----Bank64------------------
STATUS_SHAD      EQU  H'1FE4'
WREG_SHAD        EQU  H'1FE5'
BSR_SHAD         EQU  H'1FE6'
PCLATH_SHAD      EQU  H'1FE7'
FSR0_SHAD        EQU  H'1FE8'
FSR0L_SHAD       EQU  H'1FE8'
FSR0H_SHAD       EQU  H'1FE9'
FSR1_SHAD        EQU  H'1FEA'
FSR1L_SHAD       EQU  H'1FEA'
FSR1H_SHAD       EQU  H'1FEB'
STKPTR           EQU  H'1FED'
TOSL             EQU  H'1FEE'
TOSH             EQU  H'1FEF'


;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NPD              EQU  H'0003'
NTO              EQU  H'0004'
CARRY            EQU  H'0000'
ZERO             EQU  H'0002'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'
BSR5             EQU  H'0005'


;----- INTCON Bits -----------------------------------------------------
INTEDG           EQU  H'0000'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'


